
{
"projectsData" : [
    {
        "title": "Twitch.tv",
        "description": "I created a complete reproduction of the Twitch website in React.js.\n This involved reproducing all the graphics parts and components, and making multiple calls to the Twitch API to retrieve data.\n I also took care of the responsive part of the website.",        
        "link": "https://github.com/badmotherfunk/Twitch-clone-react",
        "live": "https://twitch-tv-clone.netlify.app/",
        "tags": [
            "React",
            "CSS",
            "Animation",
            "API",
            "Responsive"
        ]
    },
    {
        "title": "Ohmyfood",
        "description": "Ohmyfood is an online food booking site it allows users to access restaurant menus and make reservations.\n This project focused on the creation of CSS animations, the use of Sass and responsive design.",        
        "link": "https://github.com/badmotherfunk/ohmyfood",
        "live": "https://badmotherfunk.github.io/ohmyfood/",
        "tags": [
            "HTML",
            "CSS",
            "Animation",
            "Responsive",
            "Figma"
        ]
    },
    {
        "title": "Kasa",
        "description": "Kasa is an 10-years-old agency specialized in the private rental. They recently decided to upgrade their web app using Node-Js for the back-end, and React-Js for the front-end.\n The aim of this project is to set up a React application with reusable components and to make API calls to retrieve data.",        
        "link": "https://github.com/badmotherfunk/kasa",
        "live": "https://badmotherfunk.github.io/kasa/",
        "tags": [
            "React",
            "Sass",
            "Node.js",
            "Figma",
            "Animation"
        ]
    },
    {
        "title": "ArgentBank",
        "description": "ArgentBank is an online banking site. It allows users to log in, view their transactions and modify their informations.\n The aim of this project was to implement a React application, set up user interactions using an API, and create the future Swagger implementation. \n Notably using Redux and MongoDb.",
        "link": "https://github.com/badmotherfunk/argent-bank-front-end",
        "live": "https://argent-bank-app.netlify.app/",
        "tags": [
            "React",
            "Redux",
            "Green Code",
            "MongoDb",
            "API",
            "Axios",
            "JWT",
            "Swagger"
        ]
    },
    {
        "title": "Sophie Bluel",
        "description": "Sophie Bluel is an interior designer.\n The aim of this project was to create a portfolio that allows users to log in, add projects to the home page, filter projects, and delete projects via modals.\n This project involved making calls to an API, and creating projects dynamically in Javascript.",
        "link": "https://github.com/badmotherfunk/portfolio-sophie-buel",
        "tags": [
            "HTML",
            "CSS",
            "JavaScript",
            "Node.js",
            "Figma",
            "API",
            "CRUD"
        ]
    },
    {
        "title": "Booki",
        "description": "Booki is a company offering a vacation planning tool.\n The site allows users to find accommodation and activities in the city of their choice. \n The aim of this project was to create a prototype site by integrating the mock-up designed by the UI designer. With a focus on repsonsive design.",
        "link": "https://github.com/badmotherfunk/Booki",
        "live": "https://badmotherfunk.github.io/Booki/",
        "tags": [
            "HTML",
            "CSS",
            "Responsive",
            "Figma"
        ]
    },
    {
        "title": "Menu Maker by Qwenta",
        "description": "Menu maker by Qwenta is an online menu creation site.\n The aim of this project was to plan the development of the site, choosing the technologies to be used on both the front-end and back-end side.\n The aim was to familiarize ourselves with Agile methods and draw up the project's technical and functional specifications.",
        "link": "https://github.com/badmotherfunk/MenuMaker-by-Qwenta",
        "tags": [
            "Agile",
            "Kanban",
            "Management",
            "User Stories",
            "Trello"
        ]
    },
    {
        "title": "Nina Carducci",
        "description": "Nina Carducci is a professional photographer based in France.\n She decided to update her website to solve performance problems and improve search engine ranking.\n The aim of this project was to optimize the website's performance, and implement best practices in accessibility and search engine optimization.",
        "link": "https://github.com/badmotherfunk/Nina-Carducci-web-site-optimisation",
        "live": "https://badmotherfunk.github.io/Nina-Carducci-web-site-optimisation/",
        "tags": [
            "SEO",
            "Accessibility",
            "Lighthouse",
            "Schema.org",
            "Wave"
        ]
    }
]
}
